<template>
	<div class="wrap" v-show='bol'>
		<div class="box">
			<a href="javascript:window.history.back()" class="el-icon-close"></a>
			<h2>注册协议</h2>
			<p><strong>【审慎阅读】</strong>您在申请注册流程中点击同意前，应当认真阅读以下协议。<strong style="text-decoration: underline;">请您务必审慎阅读、充分理解协议中相关条款内容，其中包括：</strong></p>
			<ol>
				<li>1、<strong>与您约定免除或限制责任的条款；</strong></li>
				<li>2、<strong>与您约定法律适用和管辖的条款；</strong></li>
				<li>3、<strong>其他以粗体下划线标识的重要条款。</strong></li>
			</ol>
			<p>如您对协议有任何疑问，可向平台客服咨询。</p>
			<p style="line-height:18px;"><strong>【特别提示】</strong>当您按照注册页面提示填写信息、阅读并同意协议且完成全部注册程序后，即表示您已充分阅读、理解并接受协议的全部内容。如您因平台服务于帅柏发生争执的，适用《帅柏商城服务协议》处理。如您在使用平台服务过程中与其他用户发生争执的，依您与其他用户达成的协议处理。</p>
			<p style="text-decoration: underline;font-weight:600;">阅读协议的过程中，如果您不同意相关协议或其中任何条款约定，您应立即停止注册程序。</p>
			<p style="margin-top: 10px;"><a href="javascript:void(0);" @click='protocolBol=true;' >《帅柏商城服务协议》</a></p>
			<div style="width：100%;text-align: center;margin-top: 20px;">
				<el-button type='primary' style='width: 300px;' @click='bol=false'>同意协议</el-button>
			</div>
		</div>
		<!-- 协议弹框 -->
		<div class="protocol" v-show='protocolBol'>
			<em class='el-icon-close' style="cursor: pointer;" @click='protocolBol=false;'></em>
			<div>
				<h1 style="text-align: center;margin-bottom: 10px;">“帅柏商城”开放平台服务协议</h1>
				<p>
					本协议由缔约双方在自愿、平等、公平及诚实信用原则基础上，并遵守《中华人民共和国合同法》等相关法律、法规签订。
				</p>
				<p>
					本协议由协议正文、附件及依据本协议公示于“帅柏商城”开放平台（以下简称“帅柏平台”）的各项规则所组成，协议附件及规则与本协议具有同等法律效力，如规则与本协议约定不一致的，以公布生效日期或签署日期在后的文件为准执行。
				</p>
				<p>
					本协议各条的标题仅为方便阅读而设，无意成为本协议的一部分，也不影响本协议的含义或解释。<br>
					<strong>第一条相关定义及解释</strong><br>
					1.1帅柏：帅柏简介<br>
					1.2“帅柏商城”网站：指由“帅柏”提供技术支持和服务的域名为www.shuaibomall.net的网站。<br>
					1.3帅柏平台：是“帅柏商城”网站上为用户提供信息发布、交流，第三方经营者开设店铺经营，以及其他技术服务的电子商务交易服务平台。<br>
					1.4“帅柏商城”网站用户：指所有在“帅柏商城”网站上注册成为“帅柏商城”注册会员的法人、自然人及其他组织，本协议中统称为“用户”，除非另有说明，否则“用户”均指此含义。<br>
					1.5商家注册及入驻：商家注册指欲成为“帅柏平台”第三方经营者的商家（本文或称“卖家”），依据“帅柏平台”入驻流程和要求完成在线信息提交，经“帅柏”审核同意后，商家可以使用其自行设定的帅柏平台用户名和密码登陆“帅柏平台”，以开立店铺开展经营；商家入驻，亦称“店铺入驻”指第三方经营者完成商家注册，通过资质审核且满足本协议第四条店铺服务开通条件后成为“帅柏平台”第三方经营者的过程；本协议中的商家指本协议缔约方中的“乙方”。<br>
					1.6帅柏平台用户名：亦称“店铺用户名”，是指商家完成商家注册后获取的与自设密码共同使用以登陆“帅柏平台”商家管理系统，使用“帅柏平台”店铺服务的登陆账户，每一个帅柏平台用户名对应一个店铺。商家应妥善保管店铺用户名及密码信息，不得擅自转让或授权他人使用。<br>
					1.7店铺：商家在完成商家注册及商家入驻流程后，为进行合法经营，依据协议约定和帅柏平台规则由乙方申请，“帅柏”审核通过的网络化虚拟商铺，乙方可依据经营需要，开设一个店铺。乙方通过帅柏平台用户名可以实现对该店铺的管理，包括但不限于商品信息上传、修改、删除处理，交易跟踪、取消等。<br>
					1.8帅柏平台规则：指标示在“帅柏平台”之上的，与商家经营有关的任何规范性文件，包括但不限于卖家手册、卖家后台公告、卖家后台帮助中心等。<br>
					1.9保证金：商家向“帅柏”缴纳的用以保证本协议履行及对商品和服务质量进行担保的金额，“帅柏”可以依照本协议的相关约定对其进行处置。<br>
					1.10平台使用费：商家使用“帅柏平台”各项服务时按照本协议约定缴纳的固定技术服务费用。具体缴纳标准见本协议附件。<br>
					<strong>第二条服务内容及乙方店铺经营方式</strong><br>
					2.1甲方依照本协议第四条约定为乙方开通店铺服务后，乙方可使用“帅柏平台”发布商品信息，与愿意购买乙方商品的甲方其他用户进行在线交流，订立买卖合同，并向通过“帅柏平台”购买其商品的用户提供售后服务，同时可参与“帅柏平台”相关活动及使用“帅柏平台”同意提供的其他有偿服务。<br>
					2.2除上述服务内容外，乙方可使用本协议附件列明的其他甲方提供的有偿服务，具体服务内容以本协议附件约定或双方另行签署（含乙方同意相关有偿服务的电子协议等以数据电文形式签署）的文件约定为准。<br>
					2.3乙方店铺经营方式：乙方店铺内商品，均以乙方自身名义进行商品信息上传、展示、咨询答复、商品销售、发票开具、物流配送服务及售后服务提供等；乙方销售及服务出现争议、纠纷、国家机关机构调查时，由乙方以销售者身份处理。“帅柏”不参与乙方店铺的经营，除依据本协议相关约定外，也不直接介入乙方与其他人间的争议和纠纷。<br>
					2.4如果因乙方出售的产品出现假冒伪劣、产品质量问题或者出售的产品侵犯他人知识产权，被追究民事责任，出现甲方承担连带责任而对他人进行赔偿情形，在甲方作出赔偿后，乙方应无条件向甲方支付由此产生的一切费用，包括但不限于诉讼费、律师费及处理该纠纷所产生的一切费用；由此导致甲方被行政处罚的，所产生的行政罚款等经济损失，亦由乙方向甲方作出赔偿。<br>
					上述损失产生后，如果乙方不及时支付给甲方，甲方有权在乙方缴纳的保证金中扣除相应数额，保证金不足支付的，乙方应另行支付补足，并重新足额缴纳保证金。如果乙方拒绝缴纳保证金或保证金不足经催告后仍不补足的，甲方有权解除本协议。<br>
					2.5帅柏平台只允许销售国产品牌，并允许一个品牌多家入驻，避免出现一家独大的现状出现，在服务与质量基础上禁止打价格战；商城采用现金加积分的形式消费。<br>
					<strong>第三条入驻条件及证明文件提交</strong><br>
					3.1入驻条件乙方申请成为“帅柏平台”入驻商家，在“帅柏平台”开展经营活动，须满足以下条件：<br>
						1)乙方已依照中华人民共和国法律注册并领取合法有效的营业执照及其他经营许可；<br>
						2)乙方申请经营的商品来源合法，资质齐全；<br>
						3)乙方同意本协议及帅柏平台相关规则。<br>
						4)乙方所经营的商品应都为国产。<br>
					3.2证明文件提交<br>
					3.2.1乙方须根据帅柏平台相关规则及要求向甲方提交证明文件或其他相关证明，包括但不限于营业执照、税务登记证、授权委托书、商标注册证、质检报告、报关单、检验检疫证书、产品来源地证明等。<br>
					3.2.2乙方保证向甲方提供的上述证明文件或其他相关证明真实、合法、准确、有效，并保证上述证明文件或其他相关证明发生任何变更或更新时，及时通知甲方，若上述文件变更或更新导致乙方不符合本协议所规定入驻条件的，甲方有权单方全部或部分限制乙方经营，直至终止本协议。<br>
					3.2.3乙方对其提交的证明文件或其他相应证明的真实性、合法性、准确性、有效性承担全部法律责任，若因乙方提交虚假、过期文件或未及时更新或通知证明文件导致纠纷或被相关国家机关处罚的，由乙方独立承担全部法律责任，如因此造成帅柏（包括“帅柏”合作方、代理人或职员）损失的，乙方应予以赔偿。<br>
					<strong>第四条店铺服务开通及停止</strong><br>
					4.1对于乙方拟开展经营的特定店铺，甲方在乙方提出开店申请并满足以下条件后7个工作日内为乙方开通服务，甲方将在服务正式开通前一个工作日以邮件、电话或其他方式通知乙方。<br>
						1)乙方已按照本协议附件《乙方信息确认表》或者其他补充协议（若有）中确定的金额足额缴纳保证金；<br>
						2)乙方已按照本协议及帅柏平台相关规则提交证明文件或其他相关证明并已通过甲方审核；<br>
						3)乙方已注册成为帅柏平台用户且本协议已签署生效；<br>
						4)乙方已按照附件《店铺信息表》或相关补充协议（若有）足额缴纳特定店铺相应服务期的平台使用费。根据产品情况实际收取 (1-10)%不等。<br>
					4.2甲方为乙方开通服务后，乙方可利用帅柏平台用户名及自设密码登陆商家后台，根据帅柏平台相关规则及流程向乙方特定店铺上传、发布商品信息，与用户交流达成交易，使用本协议约定的其他有偿服务等。<br>
					4.3乙方店铺服务的停止：<br>
					4.3.1乙方需要停止店铺服务的，应至少提前七个工作日向甲方提出申请，经甲方审核同意后由甲方停止该店铺的服务功能；为弥补甲方已投入的人力、物力和技术支持，乙方同意甲方不退还该店铺未到期部分对应的平台使用费；<br>
					4.3.2出现以下任一情形时，甲方有权随时停止乙方相关店铺的服务；<br>
					4.3.2.1乙方不满足入驻条件的；<br>
					4.3.2.2乙方提供虚假资质文件的；<br>
					4.3.2.3乙方未完成承诺销售额的；<br>
					4.3.2.4乙方产品价格、规格等信息标示错误，导致行政处罚、争议和纠纷的；<br>
					4.3.2.5乙方产品质量、标识不合格的，或者产品涉嫌走私、假冒伪劣、旧货、返修品的；<br>
					4.3.2.6未经甲方事先审核产品品牌，而上传某品牌商品的；<br>
					4.3.2.7乙方连续30（三十）日或累计45（四十五）日未正常经营店铺的；<br>
					4.3.2.8其他违反本协议约定或帅柏平台规则的，或者其他甲方认为侵犯帅柏或消费者权益的。<br>
					4.4乙方未经甲方同意，擅自停止店铺经营，或者乙方因为出现4.3.2情形被甲方停止店铺服务的，乙方已缴纳的相关店铺的平台使用费未到期部分，作为乙方向甲方支付的违约金，该金额不足以冲抵乙方应付违约金和赔偿金时，乙方应另行支付差额。<br>
					<strong>第五条双方权利及义务</strong><br>
					5.1甲方根据本协议向乙方提供电子商务交易平台及相应技术支持服务，尽力维护“帅柏平台”的正常稳定运行，并努力提升和改进技术，对平台功能及服务进行更新、升级，不断提升平台性能和交易效率。<br>
					5.2甲方对乙方在使用“帅柏平台”过程中遇到的问题及提出的建议和意见积极予以回复，可依乙方需求对其使用“帅柏平台”提供合理的指导和培训。<br>
					5.3乙方同意甲方根据乙方营业执照所载明的经营范围及乙方申请经营的经营类目，核实及调整乙方在“帅柏平台”经营的具体商品的种类、数量和类目范围。<br>
					5.4乙方同意并自愿遵守甲方根据国家相关法律法规、政策及平台运营情况，对公示于“帅柏平台”的规则、流程、收费标准等进行更新、调整。<br>
					5.5乙方同意甲方对乙方提供的相关资质文件及各类信息资料进行审核。甲方审核为形式审核，审核通过并不代表甲方对审核内容的真实性、合法性、准确性、及时性的确认，乙方仍须对其提交的资料的真实性、合法性、准确性、及时性等承担相应的法律责任。<br>
					5.6甲方有权对乙方的注册信息、上传的相关数据信息、在“帅柏平台”发布的其他信息及交易行为进行监督检查，对发现的违法违规信息及其相关内容，乙方同意甲方不经通知立即删除，对发现的其他问题或疑问有权向乙方发出询问及要求改正的通知，乙方应在接到通知后立即做出说明或改正。对乙方前述不当行为，甲方有权追究其违约、侵权责任并/或解除本协议。<br>
					5.7甲方有权将经国家生效法律文书或行政文书确定的乙方违法违规事件，或乙方已确认的乙方违反本协议相关约定的事项，在“帅柏平台”上予以公示；乙方多次违规或者有严重违约、违规情形的，甲方有权对其采取暂停店铺运营、扣除保证金直至终止本协议等措施，上述措施不足以补偿甲方损失的，甲方有权继续向乙方追偿。<br>
					5.8如乙方的运营情况不能满足“帅柏平台”要求，经限期整改调整后，仍无法满足平台运营条件的，甲方有权解除本协议，停止向乙方提供服务。<br>
					5.9甲方有权根据市场情况及“帅柏平台”入驻商家经营情况组织相应的促销活动，乙方应根据自身经营情况及商品情况积极予以支持。<br>
					5.10甲方有权要求乙方提供与乙方商品、售后服务等相关的信息，以便于客户直接向“帅柏平台”客服中心进行咨询时予以回复，对于甲方无法回答或属乙方掌握的情况，甲方有权要求乙方在指定的时限内予以回复或给出相应方案，对乙方未及时解决的客户咨询及投诉，甲方有权对乙方采取相应处理措施。<br>
					5.11如因乙方商品、发布的信息或提供的售后服务问题而引发客户对甲方及/或“帅柏平台”的诉讼，甲方及/或“帅柏平台”有权披露乙方为实际商品提供商，乙方应承担因客户诉讼而产生的全部法律责任，如因此而给甲方及/或“帅柏平台”造成损失的，甲方有权要求乙方赔偿甲方及“帅柏平台”的全部损失。<br>
					5.12乙方同意“帅柏”根据业务调整情况将本协议项下的权利和义务部分或全部转移给甲方关联公司，但须提前5日通知乙方。<br><br>
					<strong>第六条乙方声明及保证</strong><br>
					6.1保证在“帅柏平台”提交的注册资料真实、准确、合法、有效，对获得的与自设密码共同使用的帅柏平台用户名（店铺用户名）妥善保管，不得擅自转让或授权他人使用，并对利用该用户名和密码所进行的一切活动负全部责任。<br>
					6.2保证符合本协议约定的入驻条件，保证向甲方提交的证明文件及其他相关证明真实、准确、合法、有效，并保证在上述资料发生变更时及时通知甲方，并在“帅柏平台”上予以更新。<br>
					6.3保证其有权利订立本协议，其代理人已获得充分授权，并对代理人的行为承担法律责任，同时乙方保证对其雇员、本协议约定的联系人及其他乙方委派的履行本协议的人员的行为承担法律责任。<br>
					6.4保证遵守本协议及附件的相关约定和帅柏平台相关规则及流程，在使用“帅柏平台”相关服务时严格按照上述约定及规则和流程使用，不从事任何有损甲方利益的行为。<br>
					6.5保证对在“帅柏平台”经营的商品拥有合法销售权，商品质量合格，符合国家相关质量标准，不侵犯任何第三方的合法权利，并对其商品质量及商品合法性独立承担全部法律责任。<br>
					6.6保证在“帅柏平台”发布的商品信息真实、准确，符合帅柏平台规则及国家相关法律法规的规定，与实际出售的商品一致，不含任何夸大或虚假内容，并对商品信息承担独立的完全的法律责任。若发布的上述信息变更的，乙方应及时在“帅柏平台”予以更新。若因信息未及时变更引起法律后果的，乙方独立承担全部责任。<br>
					6.7保证按照“帅柏平台”审核通过的商品类目和品牌经营，未经甲方确认，不得擅自增加、变更商品类目和品牌。保证按照帅柏平台规则及国家相关规定设置商品价格、售卖限制、库存数量、商品说明及其他商品信息，并对上述设置独立承担全部法律责任。乙方同时保证在经营过程中，按照“帅柏平台”相关规则使用客服IM工具，积极回复甲方用户的咨询，并保证在甲方用户提交订单后按要求发货。<br>
					6.8保证向购买其商品的甲方用户开具合法合规发票，并保证按照国家相关规定自行承担相应税费。如因乙方发票开具错误、未开具发票或者其他发票问题引起的纠纷，均由乙方独立承担相应的法律责任，如造成帅柏损失的，乙方应予以赔偿。<br>
					6.9保证按照国家相关规定、自身售后服务承诺及附件自主售后的相关要求，提供商品“修理、更换、退货”等售后服务，同时保证按照本协议附件的相关规定履行消费者权益保障及相关售后服务义务。<br>
					6.10保证在使用“帅柏平台”进行交易的过程中遵守诚实信用原则，不在交易中采取欺诈及虚假宣传、混淆等不正当竞争行为，不扰乱网上交易的正常秩序，不从事与网上交易无关的行为。<br>
					6.11乙方不得隐瞒任何可能对“帅柏平台”产生风险的事项，包括但不限于产品出现设计缺陷、质量瑕疵、权利纠纷、重大违约、上传资料包含病毒木马等，若乙方发生此类影响帅柏平台商誉、正常经营、安全的事项而乙方未及时通知甲方的，甲方有权解除本协议并追究乙方违约、侵权责任。<br>
					6.12未经甲方另行书面许可，乙方不得将本协议项下权利义务全部或部分转移给第三方；乙方聘请第三方代运营公司代表乙方运营店铺的，第三方代运营公司的一切行为均视同为乙方亲自实施，由乙方承担全部法律后果；乙方与第三方代运营公司间的权利义务关系由乙方与第三方代运营公司单独解决，不得影响到甲方及甲方其他用户的权利。<br>
					<strong>第七条违约责任</strong><br>
					7.1乙方向甲方提供虚假、失效的证明文件或其他相关证明，在“帅柏平台”发布错误、虚假、违法及不良信息或进行其他违反本协议约定的行为，给甲方及/或“帅柏平台”造成任何损失的（损失包括但不限于诉讼费、律师费、赔偿、补偿、行政机关处罚、差旅费等），乙方同意甲方自乙方缴纳的保证金及未结算货款中直接予以扣除，本协议另有约定的除外。<br>
					7.2乙方不论采取何种方式将甲方用户吸引到甲方平台以外的平台或场所进行交易或绕开甲方指定付款方式进行交易的，以及非法获取“帅柏”系统数据、利用“帅柏平台”谋取不正当利益或从事非法活动的，甲方有权扣除乙方全部保证金作为违约金，并保留向乙方继续追究违约责任的权利。<br>
					7.3乙方发生违反本协议及帅柏平台规则的情形时，甲方除有权按照本条约定要求乙方承担违约责任外，还有权按照“帅柏平台”相关管理规则采取商品立即下架、暂停向乙方提供服务、暂时关闭乙方后台管理账户、暂缓支付未结算款项、终止合作等措施。<br>
					<strong>第八条有限责任及免责</strong><br>
					8.1不论在何种情况下，甲方均不对由于电力、网络、电脑、通讯或其他系统的故障、罢工（含内部罢工或劳工骚乱）、劳动争议、暴乱、起义、骚乱、生产力或生产资料不足、火灾、洪水、风暴、爆炸、战争、政府行为等不可抗力，国际、国内法院的命令或第三方的不作为而造成的不能服务或延迟服务承担责任。<br>
					8.2本协议项下服务将按“现状”和按“可得到”的状态提供，甲方在此明确声明对服务不作任何明示或暗示的保证，包括但不限于对服务的可适用性、没有错误或疏漏、持续性、准确性、可靠性、适用于某一特定用途。<br>
					8.3使用“帅柏平台”服务下载或者获取任何资料的行为均出于乙方的独立判断，并由其自行承担因此而可能产生的风险和责任。<br>
					8.4法律地位声明：甲方为向乙方及甲方其他用户进行网上交易活动提供交易平台的平台服务提供商，并非乙方与通过“帅柏平台”购买乙方商品的甲方其他用户之间交易行为的参与方，甲方不对乙方及参与交易的甲方其他用户的任何口头、书面陈述或承诺，发布的信息及交易行为的真实性、合法性、准确性、及时性、有效性等作任何明示或暗示的保证，亦不承担任何法律责任。若因乙方与参与交易的甲方其他用户之间的交易行为引起的任何法律纠纷，包括但不限于投诉、起诉、举报及税赋等，均由参与交易的双方解决，与甲方及/或“帅柏平台”无关。但，乙方怠于履行义务时，甲方有权介入乙方与甲方其他用户间的争议，依据一般人的认知程度对该争议进行判断和处置，乙方应当予以执行。<br>
					8.5不可抗力处理：如本协议履行期间，甲乙双方任何一方遭受不可抗力，均应在遭受不可抗力后5日内通知对方，并于通知之日起15日内提供相关证明文件，不可抗力持续达到三十日的，任一方有权经通知对方提前终止本协议。因不可抗力原因而导致本协议中止、终止的，双方均不须向对方承担违约责任。
					</p>
			</div>
		</div>
	</div>	
</template>
<script >
import {errorInfo} from '../../common/js/common'
	export default {
		data(){
			return {
				bol: true,
				service_protocol:"",
				law_protocol:"",
				protocolBol: false,
			}
		}
	}
</script>
<style lang='scss' scoped>
	.wrap{
		width: 100%;
		height: 100%;
		position: absolute;
		top: 0px;
		left: 0px;
		z-index: 200;
		background-color: rgba(0,0,0,.5);
		.box{
			width: 742px;
			height: 452px;
			position: absolute;
			top: 0px;
			left: 0px;
			bottom: 0px;
			right: 0px;
			margin: auto;
			background-color: #fff;
			padding-top: 26px;
			padding-left: 36px;
			padding-right: 30px;
			padding-bottom: 30px;
		}
		.el-icon-close{
			position: absolute;
			right: 26px;
			top: 26px;
			font-size: 16px;
			color:#999;
		}
		a{
			color: #f24450;
			font-size: 14px;
			font-weight: 600;
		}
		strong{
			font-weight: 600;
		}
		ol{
			margin: 0px;
			padding: 0px;
		}
		li{
			line-height: 28px;
			strong{
				text-decoration: underline;
				font-weight: 600;
			}
			
		}
		.protocol{
			position: absolute;
		    z-index: 10;
		    width: 800px;
		    height: 72%;
		    top: 15%;
		    left: 0px;
		    right: 0px;
		    margin: auto;
		    padding: 30px;
		    overflow-y: scroll;
		    background-color: #fff;
		    p{
		    	text-indent: 2em;
		    	font-size: 14px;
		    	line-height: 20px;
		    }
		    strong{
		    	font-size: 14px;
			    font-weight: 600;
			    line-height: 28px;
		    }
		    .el-icon-close{
		    	position: absolute;
		    }
		}
	}
</style>